# !user/bin/python
# -*- coding: UTF-8 -*-
import numpy as np

# 获取数组中(0,0)，(1,1)和(2,0)位置处的元素，即1, 4, 5
x = np.array([[1, 2],
             [3, 4],
             [5, 6]])
print(x[0][0]) # 1
print(x[2, 1]) # 6
print(x[(0, 1), (0, 1)]) # [1, 4] 这里是将获取到的元素组成一个数组

# 用zip(*)解压的方式来简化操作，注意多维数组的索引最好用元组来实现
pos = [[0, 0], [1, 1], [2, 0]]
unzipped_pos = tuple(zip(*pos)) # 解压为元组，元组嵌套元组
print(x[unzipped_pos])

# 用:和...进行切片
print(x[0:1, :]) # [[1, 2]]，第0行，注意是两层方括号
print(x[(0,), ...]) # 同上，第0行，注意是两层方括号，注意这里(0,)是元组
print(x[0]) # [1, 2]，单独把第0行拿出来
print(x[(0)]) # 等价于x[0]，[1, 2]，单独把第0行拿出来

# 利用布尔值进行筛选
print(x[x > 3]) # [4 5 6]
print(x[~(x % 2 == 0)]) # 筛选奇数[1 3 5]
